data/sysbench/c2j_v2+/rndwr/150G/nvme0n1thread20
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     76464.65
    fsyncs/s:                     76464.65

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1194.76

General statistics:
    total time:                          60.0003s
    total number of events:              4588201

Latency (ms):
         min:                                  0.03
         avg:                                  0.26
         max:                                  8.61
         95th percentile:                      0.61
         sum:                            1178195.21

Threads fairness:
    events (avg/stddev):           229410.0500/361.68
    execution time (avg/stddev):   58.9098/0.01

WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     79674.40
    fsyncs/s:                     79674.40

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1244.91

General statistics:
    total time:                          60.0005s
    total number of events:              4780812

Latency (ms):
         min:                                  0.03
         avg:                                  0.25
         max:                                  9.48
         95th percentile:                      0.57
         sum:                            1176997.92

Threads fairness:
    events (avg/stddev):           239040.6000/217.54
    execution time (avg/stddev):   58.8499/0.01

WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     77964.27
    fsyncs/s:                     77964.27

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1218.19

General statistics:
    total time:                          60.0004s
    total number of events:              4678196

Latency (ms):
         min:                                  0.03
         avg:                                  0.25
         max:                                  8.58
         95th percentile:                      0.58
         sum:                            1177332.20

Threads fairness:
    events (avg/stddev):           233909.8000/324.30
    execution time (avg/stddev):   58.8666/0.01