data/sysbench/c2j_v2+/rndwr/150G/nvme0n1thread40
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     83627.98
    fsyncs/s:                     83627.98

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1306.69

General statistics:
    total time:                          60.0005s
    total number of events:              5018024

Latency (ms):
         min:                                  0.03
         avg:                                  0.47
         max:                                 19.42
         95th percentile:                      1.18
         sum:                            2358185.20

Threads fairness:
    events (avg/stddev):           125450.6000/290.58
    execution time (avg/stddev):   58.9546/0.01

WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     92972.73
    fsyncs/s:                     92972.73

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1452.70

General statistics:
    total time:                          60.0006s
    total number of events:              5578754

Latency (ms):
         min:                                  0.03
         avg:                                  0.42
         max:                                 33.00
         95th percentile:                      1.06
         sum:                            2355662.49

Threads fairness:
    events (avg/stddev):           139468.8500/328.66
    execution time (avg/stddev):   58.8916/0.01

WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     92242.36
    fsyncs/s:                     92242.36

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1441.29

General statistics:
    total time:                          60.0006s
    total number of events:              5534876

Latency (ms):
         min:                                  0.03
         avg:                                  0.43
         max:                                 19.62
         95th percentile:                      1.08
         sum:                            2356800.67

Threads fairness:
    events (avg/stddev):           138371.9000/309.82
    execution time (avg/stddev):   58.9200/0.01